app/views/restaurants/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1]]
---
<h2>
  <%= pluralize @restaurant.reviews.count, "review" %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1]]
---
<div id="reviews">
  <% if @restaurant.reviews.blank? %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1 ORDER BY "reviews"."created_at" DESC  [["restaurant_id", 1]]
---
  <% else %>
    <% @restaurant.reviews.order(:created_at).each do |review| %>