app/controllers/reviews_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("content", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Esse restaurante é muito ruim!!!"], ["restaurant_id", 1], ["created_at", "2020-06-05 12:25:59.341228"], ["updated_at", "2020-06-05 12:25:59.341228"]]
---
  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @review = Review.new(review_params)
    @review.restaurant = @restaurant
    if @review.save